results/nicolò/mongo/workloadc/rc200000_oc50000_fc10_fl100_raftrue/load_rep1_2025-05-15_18-37-31.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:mongodb-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
/opt/java/openjdk/bin/java -cp /opt/YCSB_PROJECT_ROOT/mongodb/conf:/opt/YCSB_PROJECT_ROOT/mongodb/target/mongodb-binding-0.17.0.jar:/root/.m2/repository/org/mongodb/mongo-java-driver/3.8.0/mongo-java-driver-3.8.0.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/opt/YCSB_PROJECT_ROOT/core/target/core-0.17.0.jar:/root/.m2/repository/org/xerial/snappy/snappy-java/1.1.7.1/snappy-java-1.1.7.1.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/root/.m2/repository/com/allanbank/mongodb-async-driver/2.0.1/mongodb-async-driver-2.0.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P workloads/workloadc -p recordcount=200000 -p operationcount=50000 -p fieldcount=10 -p fieldlength=100 -p readallfields=true -p mongodb.url=mongodb://mongo-mongos:27017/ycsb?w=1 -p mongodb.batchsize=500 -load
Command line: -db site.ycsb.db.MongoDbClient -s -P workloads/workloadc -p recordcount=200000 -p operationcount=50000 -p fieldcount=10 -p fieldlength=100 -p readallfields=true -p mongodb.url=mongodb://mongo-mongos:27017/ycsb?w=1 -p mongodb.batchsize=500 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2025-05-15 16:37:47:182 0 sec: 0 operations; est completion in 0 second 
May 15, 2025 4:37:47 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster created with settings {hosts=[mongo-mongos:27017], mode=SINGLE, requiredClusterType=UNKNOWN, serverSelectionTimeout='30000 ms', maxWaitQueueSize=500}
mongo client connection created with mongodb://mongo-mongos:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
May 15, 2025 4:37:47 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
May 15, 2025 4:37:47 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:1}] to mongo-mongos:27017
May 15, 2025 4:37:47 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Monitor thread successfully connected to server with description ServerDescription{address=mongo-mongos:27017, type=SHARD_ROUTER, state=CONNECTED, ok=true, version=ServerVersion{versionList=[7, 0, 20]}, minWireVersion=0, maxWireVersion=21, maxDocumentSize=16777216, logicalSessionTimeoutMinutes=30, roundTripTimeNanos=1098167}
May 15, 2025 4:37:47 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:2}] to mongo-mongos:27017
2025-05-15 16:37:57:169 10 sec: 28385 operations; 2838.22 current ops/sec; est completion in 1 minute [INSERT: Count=28393, Max=52223, Min=156, Avg=343.98, 90=429, 99=911, 99.9=2597, 99.99=3999] 
2025-05-15 16:38:07:181 20 sec: 59106 operations; 3071.49 current ops/sec; est completion in 48 seconds [INSERT: Count=30729, Max=39935, Min=144, Avg=323.45, 90=379, 99=699, 99.9=1791, 99.99=8087] 
2025-05-15 16:38:17:170 30 sec: 90317 operations; 3121.1 current ops/sec; est completion in 37 seconds [INSERT: Count=31198, Max=53055, Min=160, Avg=318.19, 90=373, 99=664, 99.9=1511, 99.99=3269] 
2025-05-15 16:38:27:170 40 sec: 121781 operations; 3146.4 current ops/sec; est completion in 26 seconds [INSERT: Count=31464, Max=8071, Min=132, Avg=315.93, 90=369, 99=608, 99.9=1583, 99.99=3853] 
2025-05-15 16:38:37:171 50 sec: 150944 operations; 2916.3 current ops/sec; est completion in 17 seconds [INSERT: Count=29165, Max=11327, Min=148, Avg=340.67, 90=409, 99=880, 99.9=2611, 99.99=9215] 
2025-05-15 16:38:47:169 60 sec: 181585 operations; 3064.41 current ops/sec; est completion in 7 second [INSERT: Count=30639, Max=253951, Min=173, Avg=324.53, 90=373, 99=625, 99.9=1448, 99.99=3027] 
May 15, 2025 4:38:52 PM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:2}] to mongo-mongos:27017 because the pool has been closed.
2025-05-15 16:38:52:783 65 sec: 200000 operations; 3279.61 current ops/sec; [CLEANUP: Count=1, Max=15207, Min=15200, Avg=15204, 90=15207, 99=15207, 99.9=15207, 99.99=15207] [INSERT: Count=18412, Max=4399, Min=166, Avg=302.51, 90=352, 99=471, 99.9=1224, 99.99=4331] 
[OVERALL], RunTime(ms), 65618
[OVERALL], Throughput(ops/sec), 3047.9441616629583
[TOTAL_GCS_G1_Young_Generation], Count, 33
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 46
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.07010271571824804
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 33
[TOTAL_GC_TIME], Time(ms), 46
[TOTAL_GC_TIME_%], Time(%), 0.07010271571824804
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 15204.0
[CLEANUP], MinLatency(us), 15200
[CLEANUP], MaxLatency(us), 15207
[CLEANUP], 95thPercentileLatency(us), 15207
[CLEANUP], 99thPercentileLatency(us), 15207
[INSERT], Operations, 200000
[INSERT], AverageLatency(us), 325.11036
[INSERT], MinLatency(us), 132
[INSERT], MaxLatency(us), 253951
[INSERT], 95thPercentileLatency(us), 444
[INSERT], 99thPercentileLatency(us), 709
[INSERT], Return=OK, 200000